sanjeev7-marvel/S32_MBD/MATLAB_Add-Ons/Toolboxes/NXP_MBDToolbox_S32K1xx/S32_Platform_SDK/platform/devices/S32K148/startup/armc/startup_S32K148.S
; <h> Flash Configuration
;   <i> 16-byte flash configuration field that stores default protection settings (loaded on reset)
;   <i> and security information that allows the MCU to restrict access to the FTFL module.
;   <h> Backdoor Comparison Key
;     <o0>  Backdoor Comparison Key 0.  <0x0-0xFF:2>
;     <o1>  Backdoor Comparison Key 1.  <0x0-0xFF:2>
;     <o2>  Backdoor Comparison Key 2.  <0x0-0xFF:2>
;     <o3>  Backdoor Comparison Key 3.  <0x0-0xFF:2>
;     <o4>  Backdoor Comparison Key 4.  <0x0-0xFF:2>
;     <o5>  Backdoor Comparison Key 5.  <0x0-0xFF:2>
;     <o6>  Backdoor Comparison Key 6.  <0x0-0xFF:2>
;     <o7>  Backdoor Comparison Key 7.  <0x0-0xFF:2>
BackDoorK0      EQU     0xFF
BackDoorK1      EQU     0xFF
BackDoorK2      EQU     0xFF
BackDoorK3      EQU     0xFF
BackDoorK4      EQU     0xFF
BackDoorK5      EQU     0xFF
BackDoorK6      EQU     0xFF
BackDoorK7      EQU     0xFF
;   </h>
;   <h> Program flash protection bytes (FPROT)
;     <i> Each program flash region can be protected from program and erase operation by setting the associated PROT bit.
;     <i> Each bit protects a 1/32 region of the program flash memory.
;     <h> FPROT0
;       <i> Program Flash Region Protect Register 0
;       <i> 1/32 - 8/32 region
;       <o.0>   FPROT0.0
;       <o.1>   FPROT0.1
;       <o.2>   FPROT0.2
;       <o.3>   FPROT0.3
;       <o.4>   FPROT0.4
;       <o.5>   FPROT0.5
;       <o.6>   FPROT0.6
;       <o.7>   FPROT0.7
nFPROT0         EQU     0x00
FPROT0          EQU     nFPROT0:EOR:0xFF
;     </h>
;     <h> FPROT1
;       <i> Program Flash Region Protect Register 1
;       <i> 9/32 - 16/32 region
;       <o.0>   FPROT1.0
;       <o.1>   FPROT1.1
;       <o.2>   FPROT1.2
;       <o.3>   FPROT1.3
;       <o.4>   FPROT1.4
;       <o.5>   FPROT1.5
;       <o.6>   FPROT1.6
;       <o.7>   FPROT1.7
nFPROT1         EQU     0x00
FPROT1          EQU     nFPROT1:EOR:0xFF
;     </h>
;     <h> FPROT2
;       <i> Program Flash Region Protect Register 2
;       <i> 17/32 - 24/32 region
;       <o.0>   FPROT2.0
;       <o.1>   FPROT2.1
;       <o.2>   FPROT2.2
;       <o.3>   FPROT2.3
;       <o.4>   FPROT2.4
;       <o.5>   FPROT2.5
;       <o.6>   FPROT2.6
;       <o.7>   FPROT2.7
nFPROT2         EQU     0x00
FPROT2          EQU     nFPROT2:EOR:0xFF
;     </h>
;     <h> FPROT3
;       <i> Program Flash Region Protect Register 3
;       <i> 25/32 - 32/32 region
;       <o.0>   FPROT3.0
;       <o.1>   FPROT3.1
;       <o.2>   FPROT3.2
;       <o.3>   FPROT3.3
;       <o.4>   FPROT3.4
;       <o.5>   FPROT3.5
;       <o.6>   FPROT3.6
;       <o.7>   FPROT3.7
nFPROT3         EQU     0x00
FPROT3          EQU     nFPROT3:EOR:0xFF
;     </h>
;   </h>
;   <h> Data flash protection byte (FDPROT)
;     <i> Each bit protects a 1/8 region of the data flash memory.
;     <i> (Program flash only devices: Reserved)
;       <o.0>   FDPROT.0
;       <o.1>   FDPROT.1
;       <o.2>   FDPROT.2
;       <o.3>   FDPROT.3
;       <o.4>   FDPROT.4
;       <o.5>   FDPROT.5
;       <o.6>   FDPROT.6
;       <o.7>   FDPROT.7
nFDPROT         EQU     0x00
FDPROT          EQU     nFDPROT:EOR:0xFF
;   </h>
;   <h> EEPROM protection byte (FEPROT)
;     <i> FlexNVM devices: Each bit protects a 1/8 region of the EEPROM.
;     <i> (Program flash only devices: Reserved)
;       <o.0>   FEPROT.0
;       <o.1>   FEPROT.1
;       <o.2>   FEPROT.2
;       <o.3>   FEPROT.3
;       <o.4>   FEPROT.4
;       <o.5>   FEPROT.5
;       <o.6>   FEPROT.6
;       <o.7>   FEPROT.7
nFEPROT         EQU     0x00
FEPROT          EQU     nFEPROT:EOR:0xFF
;   </h>
;   <h> Flash nonvolatile option byte (FOPT)
;     <i> Allows the user to customize the operation of the MCU at boot time.
;     <o.0> LPBOOT
;       <0=> Low-power boot
;       <1=> Normal boot
;     <o.1> EZPORT_DIS
;       <0=> EzPort operation is disabled
;       <1=> EzPort operation is enabled
FOPT          EQU     0xFF
;   </h>
;   <h> Flash security byte (FSEC)
;     <i> WARNING: If SEC field is configured as "MCU security status is secure" and MEEN field is configured as "Mass erase is disabled",
;     <i> MCU's security status cannot be set back to unsecure state since Mass erase via the debugger is blocked !!!
;     <o.0..1> SEC
;       <2=> MCU security status is unsecure
;       <3=> MCU security status is secure
;         <i> Flash Security
;     <o.2..3> FSLACC
;       <2=> Freescale factory access denied
;       <3=> Freescale factory access granted
;         <i> Freescale Failure Analysis Access Code
;     <o.4..5> MEEN
;       <2=> Mass erase is disabled
;       <3=> Mass erase is enabled
;     <o.6..7> KEYEN
;       <2=> Backdoor key access enabled
;       <3=> Backdoor key access disabled
;         <i> Backdoor Key Security Enable
FSEC          EQU     0xFE
;   </h>
; </h>
                IF      :LNOT::DEF:RAM_TARGET
                AREA    FlashConfig, DATA, READONLY
__FlashConfig
                DCB     BackDoorK0, BackDoorK1, BackDoorK2, BackDoorK3
                DCB     BackDoorK4, BackDoorK5, BackDoorK6, BackDoorK7
                DCB     FPROT0    , FPROT1    , FPROT2    , FPROT3
                DCB     FSEC      , FOPT      , FEPROT    , FDPROT
                ENDIF


                AREA    |.text|, CODE, READONLY


Reset_Handler   PROC
                ALIGN    4
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit

                IF      :LNOT::DEF:RAM_TARGET
                REQUIRE FlashConfig
                ENDIF


                CPSID   I               ; Mask interrupts

                LDR     R0, =SystemInit
                BLX     R0

#ifdef START_FROM_FLASH    
                ; Init ECC RAM
                LDR     R1, =__RAM_START
                LDR     R1, [R1]
                LDR     R2, =__RAM_END
                LDR     R2, [R2]
                SUBS    R2, R1
                SUBS    R2, #1
                BLE LC5
            
                MOVS    R0, #0
                MOVS    R3, #4
LC4
                STR R0, [R1]
                ADD	R1, R1, R3
                SUBS R2, #4
                BGE LC4
LC5
                NOP
#endif                
                LDR     R0, =0xE000ED08
                LDR     R1, =__VECTOR_TABLE
                STR     R1, [R0]
                LDR     R2, [R1]
                MSR     MSP, R2
                LDR     R0, =init_data_bss
                BLX     R0
                CPSIE   i               ; Unmask interrupts
                LDR     R0, =__main
                BLX      R0
                ENDP

NMI_Handler\
                PROC
                EXPORT  NMI_Handler         [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler         [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler         [WEAK]
                B       .
                ENDP
SVC_Handler\
                PROC
                EXPORT  SVC_Handler         [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler         [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler         [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler         [WEAK]
                B       .
                ENDP
DefaultISR\
                PROC
                EXPORT  DefaultISR         [WEAK]
                B       .
                ENDP
Default_Handler PROC
                EXPORT  DMA0_IRQHandler                              [WEAK]
                EXPORT  DMA1_IRQHandler                              [WEAK]
                EXPORT  DMA2_IRQHandler                              [WEAK]
                EXPORT  DMA3_IRQHandler                              [WEAK]
                EXPORT  DMA4_IRQHandler                              [WEAK]
                EXPORT  DMA5_IRQHandler                              [WEAK]
                EXPORT  DMA6_IRQHandler                              [WEAK]
                EXPORT  DMA7_IRQHandler                              [WEAK]
                EXPORT  DMA8_IRQHandler                              [WEAK]
                EXPORT  DMA9_IRQHandler                              [WEAK]
                EXPORT  DMA10_IRQHandler                             [WEAK]
                EXPORT  DMA11_IRQHandler                             [WEAK]
                EXPORT  DMA12_IRQHandler                             [WEAK]
                EXPORT  DMA13_IRQHandler                             [WEAK]
                EXPORT  DMA14_IRQHandler                             [WEAK]
                EXPORT  DMA15_IRQHandler                             [WEAK]
                EXPORT  DMA_Error_IRQHandler                             [WEAK]
                EXPORT  MCM_IRQHandler                           [WEAK]
                EXPORT  FTFC_IRQHandler                              [WEAK]
                EXPORT  Read_Collision_IRQHandler                            [WEAK]
                EXPORT  LVD_LVW_IRQHandler                           [WEAK]
                EXPORT  FTFC_Fault_IRQHandler                            [WEAK]
                EXPORT  WDOG_EWM_IRQHandler                              [WEAK]
                EXPORT  RCM_IRQHandler                           [WEAK]
                EXPORT  LPI2C0_Master_IRQHandler                             [WEAK]
                EXPORT  LPI2C0_Slave_IRQHandler                              [WEAK]
                EXPORT  LPSPI0_IRQHandler                            [WEAK]
                EXPORT  LPSPI1_IRQHandler                            [WEAK]
                EXPORT  LPSPI2_IRQHandler                            [WEAK]
                EXPORT  LPI2C1_Master_IRQHandler                             [WEAK]
                EXPORT  LPI2C1_Slave_IRQHandler                              [WEAK]
                EXPORT  LPUART0_RxTx_IRQHandler                              [WEAK]
                EXPORT  Reserved48_IRQHandler                            [WEAK]
                EXPORT  LPUART1_RxTx_IRQHandler                              [WEAK]
                EXPORT  Reserved50_IRQHandler                            [WEAK]
                EXPORT  LPUART2_RxTx_IRQHandler                              [WEAK]
                EXPORT  Reserved52_IRQHandler                            [WEAK]
                EXPORT  Reserved53_IRQHandler                            [WEAK]
                EXPORT  Reserved54_IRQHandler                            [WEAK]
                EXPORT  ADC0_IRQHandler                              [WEAK]
                EXPORT  ADC1_IRQHandler                              [WEAK]
                EXPORT  CMP0_IRQHandler                              [WEAK]
                EXPORT  Reserved58_IRQHandler                            [WEAK]
                EXPORT  Reserved59_IRQHandler                            [WEAK]
                EXPORT  ERM_single_fault_IRQHandler                              [WEAK]
                EXPORT  ERM_double_fault_IRQHandler                              [WEAK]
                EXPORT  RTC_IRQHandler                           [WEAK]
                EXPORT  RTC_Seconds_IRQHandler                           [WEAK]
                EXPORT  LPIT0_Ch0_IRQHandler                             [WEAK]
                EXPORT  LPIT0_Ch1_IRQHandler                             [WEAK]
                EXPORT  LPIT0_Ch2_IRQHandler                             [WEAK]
                EXPORT  LPIT0_Ch3_IRQHandler                             [WEAK]
                EXPORT  PDB0_IRQHandler                              [WEAK]
                EXPORT  Reserved69_IRQHandler                            [WEAK]
                EXPORT  Reserved70_IRQHandler                            [WEAK]
                EXPORT  SAI1_Tx_IRQHandler                           [WEAK]
                EXPORT  SAI1_Rx_IRQHandler                           [WEAK]
                EXPORT  SCG_IRQHandler                           [WEAK]
                EXPORT  LPTMR0_IRQHandler                            [WEAK]
                EXPORT  PORTA_IRQHandler                             [WEAK]
                EXPORT  PORTB_IRQHandler                             [WEAK]
                EXPORT  PORTC_IRQHandler                             [WEAK]
                EXPORT  PORTD_IRQHandler                             [WEAK]
                EXPORT  PORTE_IRQHandler                             [WEAK]
                EXPORT  SWI_IRQHandler                           [WEAK]
                EXPORT  QSPI_IRQHandler                              [WEAK]
                EXPORT  Reserved82_IRQHandler                            [WEAK]
                EXPORT  Reserved83_IRQHandler                            [WEAK]
                EXPORT  PDB1_IRQHandler                              [WEAK]
                EXPORT  FLEXIO_IRQHandler                            [WEAK]
                EXPORT  SAI0_Tx_IRQHandler                           [WEAK]
                EXPORT  SAI0_Rx_IRQHandler                           [WEAK]
                EXPORT  ENET_TIMER_IRQHandler                            [WEAK]
                EXPORT  ENET_TX_IRQHandler                           [WEAK]
                EXPORT  ENET_RX_IRQHandler                           [WEAK]
                EXPORT  ENET_ERR_IRQHandler                              [WEAK]
                EXPORT  ENET_STOP_IRQHandler                             [WEAK]
                EXPORT  ENET_WAKE_IRQHandler                             [WEAK]
                EXPORT  CAN0_ORed_IRQHandler                             [WEAK]
                EXPORT  CAN0_Error_IRQHandler                            [WEAK]
                EXPORT  CAN0_Wake_Up_IRQHandler                              [WEAK]
                EXPORT  CAN0_ORed_0_15_MB_IRQHandler                             [WEAK]
                EXPORT  CAN0_ORed_16_31_MB_IRQHandler                            [WEAK]
                EXPORT  Reserved99_IRQHandler                            [WEAK]
                EXPORT  Reserved100_IRQHandler                           [WEAK]
                EXPORT  CAN1_ORed_IRQHandler                             [WEAK]
                EXPORT  CAN1_Error_IRQHandler                            [WEAK]
                EXPORT  Reserved103_IRQHandler                           [WEAK]
                EXPORT  CAN1_ORed_0_15_MB_IRQHandler                             [WEAK]
                EXPORT  CAN1_ORed_16_31_MB_IRQHandler                            [WEAK]
                EXPORT  Reserved106_IRQHandler                           [WEAK]
                EXPORT  Reserved107_IRQHandler                           [WEAK]
                EXPORT  CAN2_ORed_IRQHandler                             [WEAK]
                EXPORT  CAN2_Error_IRQHandler                            [WEAK]
                EXPORT  Reserved110_IRQHandler                           [WEAK]
                EXPORT  CAN2_ORed_0_15_MB_IRQHandler                             [WEAK]
                EXPORT  CAN2_ORed_16_31_MB_IRQHandler                            [WEAK]
                EXPORT  Reserved113_IRQHandler                           [WEAK]
                EXPORT  Reserved114_IRQHandler                           [WEAK]
                EXPORT  FTM0_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM0_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM0_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM0_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM0_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM0_Ovf_Reload_IRQHandler                           [WEAK]
                EXPORT  FTM1_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM1_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM1_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM1_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM1_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM1_Ovf_Reload_IRQHandler                           [WEAK]
                EXPORT  FTM2_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM2_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM2_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM2_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM2_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM2_Ovf_Reload_IRQHandler                           [WEAK]
                EXPORT  FTM3_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM3_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM3_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM3_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM3_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM3_Ovf_Reload_IRQHandler                           [WEAK]
                EXPORT  FTM4_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM4_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM4_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM4_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM4_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM4_Ovf_Reload_IRQHandler                           [WEAK]
                EXPORT  FTM5_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM5_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM5_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM5_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM5_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM5_Ovf_Reload_IRQHandler                           [WEAK]
                EXPORT  FTM6_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM6_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM6_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM6_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM6_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM6_Ovf_Reload_IRQHandler                           [WEAK]
                EXPORT  FTM7_Ch0_Ch1_IRQHandler                              [WEAK]
                EXPORT  FTM7_Ch2_Ch3_IRQHandler                              [WEAK]
                EXPORT  FTM7_Ch4_Ch5_IRQHandler                              [WEAK]
                EXPORT  FTM7_Ch6_Ch7_IRQHandler                              [WEAK]
                EXPORT  FTM7_Fault_IRQHandler                            [WEAK]
                EXPORT  FTM7_Ovf_Reload_IRQHandler                           [WEAK]
DMA0_IRQHandler
DMA1_IRQHandler
DMA2_IRQHandler
DMA3_IRQHandler
DMA4_IRQHandler
DMA5_IRQHandler
DMA6_IRQHandler
DMA7_IRQHandler
DMA8_IRQHandler
DMA9_IRQHandler
DMA10_IRQHandler
DMA11_IRQHandler
DMA12_IRQHandler
DMA13_IRQHandler
DMA14_IRQHandler
DMA15_IRQHandler
DMA_Error_IRQHandler
MCM_IRQHandler
FTFC_IRQHandler
Read_Collision_IRQHandler
LVD_LVW_IRQHandler
FTFC_Fault_IRQHandler
WDOG_EWM_IRQHandler
RCM_IRQHandler
LPI2C0_Master_IRQHandler
LPI2C0_Slave_IRQHandler
LPSPI0_IRQHandler
LPSPI1_IRQHandler
LPSPI2_IRQHandler
LPI2C1_Master_IRQHandler
LPI2C1_Slave_IRQHandler
LPUART0_RxTx_IRQHandler
Reserved48_IRQHandler
LPUART1_RxTx_IRQHandler
Reserved50_IRQHandler
LPUART2_RxTx_IRQHandler
Reserved52_IRQHandler
Reserved53_IRQHandler
Reserved54_IRQHandler
ADC0_IRQHandler
ADC1_IRQHandler
CMP0_IRQHandler
Reserved58_IRQHandler
Reserved59_IRQHandler
ERM_single_fault_IRQHandler
ERM_double_fault_IRQHandler
RTC_IRQHandler
RTC_Seconds_IRQHandler
LPIT0_Ch0_IRQHandler
LPIT0_Ch1_IRQHandler
LPIT0_Ch2_IRQHandler
LPIT0_Ch3_IRQHandler
PDB0_IRQHandler
Reserved69_IRQHandler
Reserved70_IRQHandler
SAI1_Tx_IRQHandler
SAI1_Rx_IRQHandler
SCG_IRQHandler
LPTMR0_IRQHandler
PORTA_IRQHandler
PORTB_IRQHandler
PORTC_IRQHandler
PORTD_IRQHandler
PORTE_IRQHandler
SWI_IRQHandler
QSPI_IRQHandler
Reserved82_IRQHandler
Reserved83_IRQHandler
PDB1_IRQHandler
FLEXIO_IRQHandler
SAI0_Tx_IRQHandler
SAI0_Rx_IRQHandler
ENET_TIMER_IRQHandler
ENET_TX_IRQHandler
ENET_RX_IRQHandler
ENET_ERR_IRQHandler
ENET_STOP_IRQHandler
ENET_WAKE_IRQHandler
CAN0_ORed_IRQHandler
CAN0_Error_IRQHandler
CAN0_Wake_Up_IRQHandler
CAN0_ORed_0_15_MB_IRQHandler
CAN0_ORed_16_31_MB_IRQHandler
Reserved99_IRQHandler
Reserved100_IRQHandler
CAN1_ORed_IRQHandler
CAN1_Error_IRQHandler
Reserved103_IRQHandler
CAN1_ORed_0_15_MB_IRQHandler
CAN1_ORed_16_31_MB_IRQHandler
Reserved106_IRQHandler
Reserved107_IRQHandler
CAN2_ORed_IRQHandler
CAN2_Error_IRQHandler
Reserved110_IRQHandler
CAN2_ORed_0_15_MB_IRQHandler
CAN2_ORed_16_31_MB_IRQHandler
Reserved113_IRQHandler
Reserved114_IRQHandler
FTM0_Ch0_Ch1_IRQHandler
FTM0_Ch2_Ch3_IRQHandler
FTM0_Ch4_Ch5_IRQHandler
FTM0_Ch6_Ch7_IRQHandler
FTM0_Fault_IRQHandler
FTM0_Ovf_Reload_IRQHandler
FTM1_Ch0_Ch1_IRQHandler
FTM1_Ch2_Ch3_IRQHandler
FTM1_Ch4_Ch5_IRQHandler
FTM1_Ch6_Ch7_IRQHandler
FTM1_Fault_IRQHandler
FTM1_Ovf_Reload_IRQHandler
FTM2_Ch0_Ch1_IRQHandler
FTM2_Ch2_Ch3_IRQHandler
FTM2_Ch4_Ch5_IRQHandler
FTM2_Ch6_Ch7_IRQHandler
FTM2_Fault_IRQHandler
FTM2_Ovf_Reload_IRQHandler
FTM3_Ch0_Ch1_IRQHandler
FTM3_Ch2_Ch3_IRQHandler
FTM3_Ch4_Ch5_IRQHandler
FTM3_Ch6_Ch7_IRQHandler
FTM3_Fault_IRQHandler
FTM3_Ovf_Reload_IRQHandler
FTM4_Ch0_Ch1_IRQHandler
FTM4_Ch2_Ch3_IRQHandler
FTM4_Ch4_Ch5_IRQHandler
FTM4_Ch6_Ch7_IRQHandler
FTM4_Fault_IRQHandler
FTM4_Ovf_Reload_IRQHandler
FTM5_Ch0_Ch1_IRQHandler
FTM5_Ch2_Ch3_IRQHandler
FTM5_Ch4_Ch5_IRQHandler
FTM5_Ch6_Ch7_IRQHandler
FTM5_Fault_IRQHandler
FTM5_Ovf_Reload_IRQHandler
FTM6_Ch0_Ch1_IRQHandler
FTM6_Ch2_Ch3_IRQHandler
FTM6_Ch4_Ch5_IRQHandler
FTM6_Ch6_Ch7_IRQHandler
FTM6_Fault_IRQHandler
FTM6_Ovf_Reload_IRQHandler
FTM7_Ch0_Ch1_IRQHandler
FTM7_Ch2_Ch3_IRQHandler
FTM7_Ch4_Ch5_IRQHandler
FTM7_Ch6_Ch7_IRQHandler
FTM7_Fault_IRQHandler
FTM7_Ovf_Reload_IRQHandler

                B       .

                ENDP

                ALIGN
                END
